fsw-ear-problem/service1/service/src/main/resources/SampleLogic.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="SampleLogic" targetNamespace="urn:org.jboss.examples.earproblem.services:1.0" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="urn:org.jboss.examples.earproblem.services:1.0" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
  <wsdl:types>
<xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="urn:org.jboss.examples.earproblem.services:1.0" attributeFormDefault="unqualified" elementFormDefault="qualified" targetNamespace="urn:org.jboss.examples.earproblem.services:1.0">
  <xsd:element name="doLogic" type="tns:doLogic"/>
  <xsd:complexType name="doLogic">
    <xsd:sequence>
      <xsd:element minOccurs="0" name="string" type="xsd:string"/>
    </xsd:sequence>
  </xsd:complexType>
  <xsd:element name="doLogicResponse" type="tns:doLogicResponse"/>
  <xsd:complexType name="doLogicResponse">
    <xsd:sequence>
      <xsd:element minOccurs="0" name="string" type="xsd:string"/>
    </xsd:sequence>
  </xsd:complexType>
</xsd:schema>
  </wsdl:types>
  <wsdl:message name="doLogic">
    <wsdl:part name="parameters" element="tns:doLogic">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="doLogicResponse">
    <wsdl:part name="parameters" element="tns:doLogicResponse">
    </wsdl:part>
  </wsdl:message>
  <wsdl:portType name="SampleLogicPortType">
    <wsdl:operation name="doLogic">
      <wsdl:input name="doLogic" message="tns:doLogic">
    </wsdl:input>
      <wsdl:output name="doLogicResponse" message="tns:doLogicResponse">
    </wsdl:output>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="SampleLogicSoapBinding" type="tns:SampleLogicPortType">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="doLogic">
      <soap:operation soapAction="doLogic" style="document"/>
      <wsdl:input name="doLogic">
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="doLogicResponse">
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="SampleLogic">
    <wsdl:port name="SampleLogicPort" binding="tns:SampleLogicSoapBinding">
      <soap:address location="http://localhost:8080/example/SampleLogic"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
